Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: རིན་པོ་ཆེའི་ཁ་དོག་གྲངས་མེད་པའི་འབྱུང་གནས་སུ་གྱུར་པ་མང་པོ་དང་། གོས་ཀྱི་ཤིང་དགའ་བར་བྱེད་པ་ཞེས་བྱ་བ་ལྷ་རྫས་ཀྱི་གོས་རིན་པོ་ཆེའི་ཁ་དོག་སྣ་ཚོགས་ཀྱི་ཚོགས་རབ་ཏུ་འགྱེད་ཅིང་འཕྱང་བས་ཤིན་ཏུ་བརྒྱན་པ་མང་པོ་དང་། རོལ་མོའི་ཤིང་དགའ་བསྐྱེད་པ་ཞེས་བྱ་བ་ལྷ་རྫས་ལས་ཀྱང་ལྷག་པའི་རོལ་མོ་ཡིད་དུ་འོང་བའི་སྒྲ་སྙན་པ་འབྱིན་པ་མང་པོ་དང་། སྤོས་ཀྱི་ཤིང་ཀུན་ཏུ་ཞིམ་པས་བརྒྱན་པ་ཞེས་བྱ་བ་ཕྱོགས་ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པར་རྣམ་པ་ཐམས་ཅད་དུ་ཡིད་དུ་འོང་བའི་སྤོས་ཀྱི་ངད་འབྱུང་བ་མང་པོ་དག་ཀྱང་ཡོད་པར་མཐོང་།
en: He saw many cloth trees called prasādana , which were adorned by being strewn and hung with precious divine cloths of various colors. He saw many music trees called pramodana , which emitted the sounds of beautiful music from instruments superior to those of the devas. He saw many perfume trees called samanta­śubha­vyūha , from which arose pleasing perfumes of every kind of pleasant aroma spreading freely in all directions.

source: མཚེའུ་དང་ལུ་མ་དང་། ལྟེང་ཀ་དང་། རྫིང་བུ་རིན་པོ་ཆེ་བདུན་གྱི་ཕ་གུས་མཐའ་བརྩིགས་པ། ཕྱོགས་བཞི་ནས་རིན་པོ་ཆེའི་ཐེམ་སྐས་བཙུགས་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁྲི་འཕང་དུས་དང་འཐུན་པའི་ཙན་དན་གྱི་དྲི་ཞིམ་པོས་བསྐུས་པས་ཀུན་ནས་བསྐོར་བ། གཞི་རིན་པོ་ཆེའི་རྒྱལ་པོ་བཻཌཱུརྱ་སྔོན་པོ་ལས་ལེགས་པར་བླངས་པ། འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་བྱེ་མ་བདལ་བ་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུ་ལྷ་རྫས་ཀྱི་དྲི་ཡིད་དུ་འོང་བ་ཅན་གྱིས་ཡོངས་སུ་གང་བ།
en: There were springs, ponds, reservoirs, and pools that had balustrades made of the seven precious materials around them, with precious steps on all four sides, encircled by precious platforms perfumed with the pleasant aroma of yellow sandalwood, with perfectly laid bottoms made of precious blue beryl, the king of jewels, and which were spread with the sand of Jambu River gold and filled with aromatic divine water that had the eight qualities.

source: རིན་པོ་ཆེའི་པད་མོ་དང་། ཨུཏྤ་ལ་དང་། ཀུ་མུ་ཏ་དང་། མེ་ཏོག་པུན་ད་རི་ཀ་ཁ་དོག་སྣ་ཚོགས་ལྷ་རྫས་ཀྱི་བསུང་དང་ལྡན་པས། ཆུ་ཀུན་ནས་ཡོག་པ།
en: Their waters were covered with the various colors and divine scents of precious lotuses, blue lotuses, night lotuses, and white lotuses;

source: བྱ་བྲན་སྣ་ཚོགས་ཀྱི་ཁྱུ་ལྷ་རྫས་ལས་ཀྱང་འདས་པའི་གཟུགས་ཡིད་དུ་འོང་བ་དང་ལྡན་པ། སྒྲ་སྙན་པ་འབྱིན་ཅིང་བརྗོད་པས་གང་བ། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཤིང་གི་ཕྲེང་བ་ལེགས་པར་བཀྱེ་བས་ཡོངས་སུ་བསྐོར་ཅིང་བརྒྱན་པ་དང་ལྡན་པ་ཤིང་སྣ་ཚོགས་དེ་དག་གི་དྲུང་ཐམས་ཅད་དུའང་རིན་པོ་ཆེའི་སེང་གེའི་ཁྲི་སྣ་ཚོགས་ཡིད་དུ་འོང་བའི་གཟུགས་དང་ལྡན་པ།
en: were filled with flocks of various birds, with beauty that transcended the divine, emitting beautiful sounds;

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་དུ་མས་བརྒྱན་པ། ལྷ་རྫས་ཀྱི་སྟན་རིན་པོ་ཆེ་སྣ་ཚོགས་འབེལ་བར་བཏིང་བ།
en: and were beautified by being encircled with radiant trees made of various divine jewels.

source: ལྷ་རྫས་ཀྱི་སྤོས་དང་། བདུག་སྤོས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཀྱིས་བདུགས་པ། ལྷ་རྫས་ལས་ཀྱང་འདས་པའི་དར་རིན་པ་ཆེ་མངོན་པར་སྤྱངས་བ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་བླ་རེ་བཀྱེ་བ། རིན་པོ་ཆེ་སྣ་ཚོགས་དང་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་དྲ་བ་སྣ་ཚོགས་ཀུན་ནས་བྲེས་པ། རིན་པོ་ཆེའི་དྲིལ་གྱི་དྲ་བ་ཡིད་དུ་འོང་ཞིང་སྙན་པའི་སྒྲ་འབྱིན་པ།
en: Arranged at the feet of all those trees of various jewels were precious lion thrones, with various beautiful forms, arrayed in inconceivable adornments of various jewels, adorned and spread with divine precious cushions, perfumed by all kinds of scents and incenses, hung with precious, beyond-divine ribbons, canopied by canopies of various jewels, covered by nets of Jambu River gold and various jewels, adorned by many precious beautiful nets of bells that emitted beautiful sounds, and accompanied by many hundreds of thousands of seats made of divine jewels.

source: མང་པོས་བརྒྱན་པ། འཁོར་དུ་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་སྟན་བརྒྱ་ཕྲག་དུ་མ་བཏིང་ཞིང་བཤམས་པ་མཐོང་ངོ་། །རིན་པོ་ཆེའི་ཤིང་དྲུང་ལ་ལར་ནི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་པདྨོའི་སྙིང་པོ་ཅན་བཤམས་པ་མཐོང་ངོ་།
en: He saw, arranged at the feet of some jewel trees, lion thrones with lotuses in their centers that were made of jewels;

source: །ལ་ལར་ནི་སེང་གེའི་ཁྲི་ནོར་བུ་རིན་པོ་ཆེའི་སྤོས་ཀྱི་རྒྱལ་པོའི་པད་མོའི་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་།
en: at the feet of some, lion thrones with lotuses in their centers that were made of the precious jewel king of perfumes

source: །ལ་ལར་ནི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཀླུའི་རྒྱན་གྱི་པད་མོས་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་།
en: at the feet of some, lion thrones with lotuses in their centers that were made of the king of jewels array of nāgas

source: །ལ་ལར་ནི་སེང་གེའི་ཁྲི་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སེང་གེའི་བྱ་ལའི་པད་མོས་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་།
en: at the feet of some, lion thrones with lotuses in their centers that were made of the king of precious jewels lion’s trunk ; at the feet of some, lion thrones with lotuses in their centers that were made of the king of precious jewels the sun

source: །ལ་ལར་ནི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བའི་པད་མོས་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་།
en: at the feet of some, lion thrones with lotuses in their centers that were made of the king of precious jewels radiance

source: །ལ་ལར་ནི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཕྱོགས་རྣམ་པར་སྣང་བའི་པད་མོས་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་།
en: at the feet of some, lion thrones with lotuses in their centers that were made of the king of precious jewels Indra’s vajra

source: །ལ་ལར་ནི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་དབང་པོའི་རྡོ་རྗེའི་པད་མོས་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་།
en: at the feet of some, lion thrones with lotuses in their centers that were made of the king of precious jewels beauty of the world

source: །ལ་ལར་ནི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་འགྲོ་བའི་ཡིད་དུ་འོང་བའི་པདྨོས་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་། །རིན་པོ་ཆེའི་ཤིང་དྲུང་ལ་ལར་ནི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་མདོག་དཀར་པོའི་པད་མོས་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་།
en: and he saw, arranged at the feet of some jewel trees, lion thrones with lotuses in their centers that were made of the king of precious jewels white light

source: །བཟའ་ཤིང་གི་ར་བ་དེའི་གཞི་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་ཞིང་རྒྱ་མཚོ་ཆེན་པོ་ལྟར་རིན་པོ་ཆེའི་གླིང་གིས་ཡོངས་སུ་གང་བ་མཐོང་ངོ་། །བཻཌཱུརྱ་སྔོན་པོའི་དམ་པས་སྤྲས་ཏེ།
en: He saw that the entire ground of that great park was covered with various jewels like an ocean covered by islands of jewels.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་ས་ཕྱོགས་ཀ་ཙ་ལིན་ད་ལྟར་རེག་ན་བདེ་ཞིང་འཇམ་པ།
en: He saw that the land was beautified by blue beryl dust, was adorned with various jewels, and was as pleasant and soft to the touch as down;

source: གོམ་པ་བོར་ཞིང་བཏེག་པའི་ཚེ་མཐོ་དམན་མེད་པ། རྡོ་རྗེ་རིན་པོ་ཆེ་མཆོག་གི་པདྨོའི་དྲི་ཡིད་དུ་འོང་བར་ཞིམ་ཞིང་རེག་ན་བདེ་བའི་སིལ་མ་ཀུན་ཏུ་བཀྲམ་པ།
en: it sank as one stepped on it and rose as one lifted the foot; its surface was strewn with the petals of beautifully aromatic lotuses that were pleasant to the touch and made of diamond jewels;

source: ང་ངུར་དང་། རྨ་བྱ་དང་། ཁྲུང་ཁྲུང་དང་། ཀུ་ན་ལ་དང་། ཀ་ལ་པིང་ཀ་དང་། ཀོ་ཀི་ལ་དང་། ཛི་བན་ཛི་བ་ཀ་སྒྲ་སྙན་ཅིང་ཡིད་དུ་འོང་བའི་ང་རོ་འབྱིན་པ་མང་པོས་གང་བ།
en: it was filled with ruddy shelducks, peacocks, cranes, snipes, avadavats, cuckoos, and partridges that emitted beautiful sounds;

source: ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་ཙན་དན་གྱི་ཤིང་མང་པོའི་ནགས་ཚལ་ཤིན་ཏུ་ལེགས་པར་འགྲིགས་པས་བརྒྱན་པ།
en: it was adorned by perfectly formed forests of many divine, precious sandalwood trees;

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་པདྨོའི་སྤྲིན་གྱི་ཆར་དང་། རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་མི་ཟད་པའི་ཆར་རྒྱུན་ཏུ་འབབ་པ།
en: there was a continuous rainfall from clouds of lotuses made of various jewels and a rain of various precious flowers;

source: འདྲེས་པའི་ནགས་ཚལ་ལས་ཀྱང་ཁྱད་པར་དུ་འཕགས་པ།
en: it was superior to Miśrakavana;

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁང་བུ་བརྩེགས་མ་བརྒྱན་པར་བཀོད་པའི་ནང་ནས། སྤོས་ཀྱི་རྒྱལ་པོའི་བདུག་སྤོས་རིན་ཐང་མེད་པ་རྟག་ཏུ་འཐུལ་ཞིང་ཞིམ་པ་ལྷའི་མདུན་ས་ཆོས་བཟང་པོའི་རྒྱན་ལས་ཀྱང་ལྷག་པར་བརྒྱན་པ།
en: there were kūṭāgāras made of various jewels arrayed as adornments from within which constantly emanated the unequaled aromas of the kings of perfumes; it was a display superior to that of Sudharma, the meeting hall of the devas;

source: ལྷ་རྫས་ལས་ཀྱང་འདས་པའི་རིན་པོ་ཆེའི་དྲ་བ་སྣ་ཚོགས་ཀྱིས་ཀུན་ནས་བྲེས་པ།
en: they were covered with nets of various jewels that were superior to divine jewels;

source: མུ་ཏིག་རིན་པོ་ཆེའི་མེ་ཏོག་གི་ཕྲེང་བ་དང་། ལྡ་ལྡི་ཀུན་ནས་བྲེས་པས་རབ་ཏུ་བརྒྱན་པ། རིན་པོ་ཆེའི་དྲིལ་བུ་རྣམ་པ་སྣ་ཚོགས་སུ་རྣམ་པར་བཀྱེ་བའི་གསེར་གྱི་དྲ་བ་འབར་བས། ཀུན་ནས་དཀྲིགས་པ།
en: they were adorned by hanging bundles of pearls, jewels, and flowers; they were entirely adorned by shining gold nets arrayed with a variety of precious bells.

source: རོལ་མོའི་ཤིང་དང་། རིན་པོ་ཆེའི་ཏ་ལ་ལས་དྲིལ་བུའི་དྲ་བ་རླུང་གིས་ལེགས་པར་བསྐྱོད་པས་ཡིད་དུ་འོང་བའི་སྒྲ་སྙན་པའི་དབྱངས་འབྱུང་བ་དང་ལྡན་པ།
en: Beautiful and pleasant music came from trees with a variety of musical instruments, precious palm trees, and nets of bells when they were stirred by the breeze.

source: དབང་བསྒྱུར་གྱི་ལྷའི་རྒྱལ་པོའི་ལྷ་མོ་དཔེ་ཚུལ་ཤིན་ཏུ་བཟང་བ་རྣམས་ཀྱིས་གླུ་སྙན་པའི་སྒྲ་རབ་ཏུ་ཡིད་དུ་འོང་བ་ལེན་མ།
en: There arose the perfectly delightful sound of songs like those of the apsarases of the king of the Vaśavartin devas.

source: ལྷ་རྫས་ཀྱི་ཡིད་བཞིན་གྱི་གོས་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབབ་པས་རྣམ་པར་མཛེས་པ།
en: The park was beautified by a rain that fell from clouds of divine cloths, of various colors, that fulfilled all wishes.

source: རྒྱ་མཚོ་ཆེན་པོ་ལྟར་ཁ་དོག་དང་། མདོག་སྣ་ཚོགས་སུ་ལྡན་པས་བལྟ་ན་གཏང་མྱི་བྲ་བ།
en: It resembled a vast ocean with a variety of colors and lusters so that one could not stop looking at it.

source: ཁང་པ་བརྩེགས་པ་རིན་པོ་ཆེའི་རྒྱན་དང་ལྡན་པ་བརྒྱ་སྟོང་གྲངས་མྱེད་པས་རབ་ཏུ་བརྒྱན་པ། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་ཕོ་བྲང་ལྟར་བལྟ་ན་བཟང་བ། རིན་པོ་ཆེ་སྣ་ཚོགས་རྣམ་པར་ཕྱེ་བས་རྣམ་པ་ཐམས་ཅད་དུ་བརྒྱན་པའི་གདུགས་ཤིན་ཏུ་ལེགས་པ།
en: It was adorned by countless hundreds of thousands of kūṭāgāras adorned with jewels. It was as beautiful to behold as the residence of Indra in Trāyastriṃśa. It was adorned by an array of various jewels of every kind.

source: རྣམ་པར་བསྒྲེང་ཞིང་བཀྲམ་པས་ཀུན་ནས་བལྟ་ན་མཛེས་པ།
en: There was the beautiful sight of an array of perfectly formed parasols standing erect.

source: དབང་པོ་ཆེན་པོའི་འཇིག་རྟེན་ལྟར་ཤིན་ཏུ་མཛེས་པའི་དེའུ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ།
en: It was made beautiful by various pinnacles, like the realm of great Indra.

source: ཡིད་དུ་འོང་བའི་འོད་སྣང་བ་ཆེན་པོ་རྟག་པར་འབྱུང་བ།
en: There shone constantly a great beautiful radiance of light.

source: ཚངས་པ་ཆེན་པོའི་གཞལ་མྱེད་ཁང་ལྟར་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་འགྲོ་བ་ཡིད་དུ་འོང་བའི་འོད་ཀྱིས་འབར་བ་སྟེ།
en: Like the divine palace of Mahābrahmā, it was radiant with the light of the kings of jewels that brought delight to beings.

source: བཟའ་ཤིང་གི་ར་བ་ཆེན་པོ་ཉི་མའི་མདོག་ཅེས་བྱ་བ་དེ། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་རྫུ་འཕྲུལ་གྱི་མཐུ་སྟོབས་དང་། བྱིན་གྱི་རླབས་ཆེ་ཞིང་བསམ་གྱིས་མི་ཁྱབ་པས། འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པའི་གནས་སུ་གྱུར་པའི་ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་ཤིང་ཚད་མེད་དེ།
en: That great park called Sūrya­prabha , through the bhikṣuṇī Siṃha­vijṛmbhitā’s great, inconceivable, miraculous abilities and attainment of power, was as vast, immense, and extensive as the expanse of the sky over countless world realms.

source: རྒྱ་ཆེན་པོ་དང་ལྡན་པ་མཐོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དེ་ལྟར་ཡོན་ཏན་ཚད་མྱེད། བསམ་གྱིས་མི་ཁྱབ་པ་ཚོགས་པའི་བཟའ་ཤིང་གི་ར་བའི་རྒྱན་བྱང་ཆུབ་སེམས་དཔའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ཡོངས་སུ་གྲུབ་པ།
en: Sudhana, the head merchant’s son, saw in that way the displays in the park of aggregations of measureless, inconceivable qualities, which were accomplished through the ripening of a bodhisattva’s karma;

source: འཇིག་རྟེན་ལས་འདས་པའི་དགེ་བའི་རྩ་བ་རྒྱ་ཆེན་པོ་ལས་སྐྱེས་པ། སངས་རྒྱས་ལ་མཆོད་ཅིང་རིམ་གྲོར་བྱས་པའི་རྒྱུ་འཐུན་པ་བསམ་གྱིས་མྱི་ཁྱབ་པ་ལས་བྱུང་བ།
en: which were born from vast, transcendent roots of merit that appeared as the natural result of inconceivable offering and service to buddhas;

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན་ཡོད་པའི་དགེ་བའི་རྩ་བ་མ་ལུས་པས་མྱི་འཕྲོགས་པ།
en: which all the roots of merit without exception in all worlds could not surpass;

source: ཆོས་ཀྱི་རང་བཞིན་སྒྱུ་མའི་རྣམ་པ་ལྟ་བུས་གྲུབ་པ།
en: which were present as the illusory nature of phenomena;

source: དགེ་བའི་བསོད་ནམས་དྲི་མ་མྱེད་པ་རྒྱ་ཆེན་པོས་གྲུབ་ཅིང་བྱུང་བ།
en: which originated from the ripening of the merit of vast, stainless virtue;

source: དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་སྔོན་གྱི་སྤྱོད་པ་བཟང་པོ་ལེགས་པར་བྱས་པ་དང་། རྒྱུ་འཐུན་པའི་སྟོབས་དང་། ཤུགས་ཀྱིས་བྱུང་བ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། ཐུན་མོང་མ་ཡིན་པ།
en: which originated from the strength and power that is the natural result of the conduct perfectly accomplished in the past by the bhikṣuṇī Siṃha­vijṛmbhitā; which could not be surpassed by all the śrāvakas and pratyeka­buddhas;

source: མུ་སྟེགས་ཅན་དང་། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་འཕྲོགས་པ།
en: which could not be destroyed by tīrthikas and opponents;

source: བདུད་ཀྱི་ལམ་ཡོངས་སུ་རྒྱུ་བ་ཐམས་ཅད་ཀྱིས་མྱི་ཚུགས་པ།
en: which could not be harmed by any of the activities of the path of the māras;

source: བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ཀྱིས་བལྟར་མེད་པ་མཐོང་སྟེ།
en: and which could not be seen at all by ordinary, foolish beings.

source: ཤིང་སྣ་ཚོགས་དེ་དག་གི་དྲུང་གི་སེང་གེའི་ཁྲི་ཆེན་པོ་དེ་དག་ལ་འང་དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ། ལུས་ཤིན་ཏུ་མཛེས་པ། སྤྱོད་ལམ་ཞི་བ། ཡིད་ཞི་བ།
en: He saw seated upon lion thrones at the feet of all those various precious trees the bhikṣuṇī Siṃha­vijṛmbhitā surrounded by a great assembly. She had a beautiful body, the peaceful conduct of a mendicant, pacified senses, and a peaceful mind;

source: ཤིན་ཏུ་དབེན་པ། དབང་པོ་ཐུལ་བ།
en: she was perfectly self-controlled and had conquered her senses;

source: གླང་པོ་ལྟར་ཤིན་ཏུ་དུལ་བ།
en: she was as perfectly tamed as an elephant;

source: མཚོ་ལྟར་དང་ཞིང་གསལ་ལ་རྙོག་པ་མེད་པའི་སེམས་དང་ལྡན་པ།
en: her mind was as pure, clear, and unsullied as a lake;

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་ཡིད་བཞིན་གྱི་ནོར་བུ་ལྟར་འདོད་པ་ཐམས་ཅད་སྒྲུབ་པ།
en: she fulfilled all wishes like a king of wish-fulfilling jewels;

source: པད་མོ་ལ་ཆུས་མི་ཆགས་པ་ལྟར་འཇིག་རྟེན་གྱི་ཆོས་ཀྱིས་མ་གོས་པ།
en: she was as unstained by worldly concerns as a lotus by water;

source: སེང་གེ་ལྟར་འཇིགས་པ་དང་། སྐྱི་གཡའ་བ་མྱེད་པ།
en: she was as free of fear and trepidation as a lion;

source: མི་འཇིགས་པ་རྣམ་པར་དག་པས། རིའི་དབང་པོ་ཆེན་པོ་ལྟར་མྱི་སྒུལ་བ།
en: because of her perfectly pure confidence she was as unshakable as the great king of mountains;

source: ཚུལ་ཁྲིམས་རྣམ་པར་དག་པས་ཡིད་དུ་འོང་བའི་སྤོས་ཀྱི་རྒྱལ་པོ་ལྟར་འགྲོ་བའི་སེམས་ཚིམ་པར་བྱེད་པ།
en: because of her pure discipline she brought delight to beings like the king of entrancing perfumes;

source: ཁ་བའི་ཙན་དན་ལྟར་ཉོན་མོངས་པའི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད་པ།
en: like Himalayan sandalwood, she extinguished the burning of the kleśas;

source: སྨན་གྱི་རྒྱལ་པོ་བལྟ་ན་བཟང་བ་ལྟར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་རྣམ་པར་ཞི་བར་བྱེད་པ།
en: like the beautiful king of herbs, she brought an end to the sufferings of all beings;

source: ཆུའི་ལྷའི་ཞགས་པ་ལྟར་བལྟ་ན་དོན་ཡོད་པ། དེ་བཞིན་གཤེགས་པའི་འོད་ལྟར་ལུས་དང་སེམས་ཀྱི་བག་ཡངས་བདེ་བ་བསྐྱེད་པ།
en: like the noose of Varuṇa, she was a beneficial sight; like the light from a tathāgata, she brought peace and happiness to body and mind;

source: ཚངས་པ་ཆེན་པོ་ལྟར་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ཀུན་ནས་ལྡང་བ་དང་བྲལ་བ།
en: like Mahābrahmā, she was free from the arising of anger, desire, and ignorance;

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་ནོར་བུ་ཆུ་འདང་ལྟར་ཉོན་མོངས་པས་རྙོག་པ་ཅན་དུ་གྱུར་པའི་སེམས་ཅན་གྱི་སེམས་རབ་ཏུ་དང་བར་བྱེད་པ།
en: like the king of jewels that purifies water, she brought delight to the minds of beings that were turbid with kleśas;

source: ཞིང་གཤིན་པ་ལྟར་དགེ་བའི་རྩ་བ་རྣམ་པར་འཕེལ་བར་བྱེད་པ་འདུག་པར་མཐོང་ངོ་།
en: and like a fertile land, she multiplied the roots of merit.

source: །འཁོར་གྱི་སྟན་དེ་དག་ལའང་འཁོར་སྣ་ཚོགས་འཁོད་པར་མཐོང་སྟེ།
en: On the surrounding seats a diverse assembly was seated.

source: འཁོར་གྱི་སྟན་ལ་ལ་ལ་ནི་ལྷའི་བུ་དབང་པོ་ཆེན་པོ་ལ་སྩོགས་པ། གཙང་མའི་གནས་ཀྱི་རིགས་སུ་གཏོགས་པའི་ལྷའི་བུ་རྣམས་འཁོད་ཅིང་དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས། ཆོས་ཀྱི་སྒོ་རྣམ་པར་ཐར་པ་མྱི་ཟད་པ་ཡང་དག་པར་འབྱེད་པ་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called the categories of unceasing liberation to the deva Maheśvara and other inhabitants of the Śuddhāvāsa paradise who were seated upon some of the assembly seats.

source: །འཁོར་གྱི་སྟན་ལ་ལ་ནི་ཚངས་པ་ཡིད་དུ་འོང་བ་ལ་སྩོགས་པ། ཚངས་པའི་རིས་སུ་གཏོགས་པའི་ལྷའི་བུ་རྣམས་འཁོད་ཅིང་དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས། དབྱངས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ། གཞི་ཀུན་ནས་འབྱེད་པ་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the pure realm of sound called the complete categories of the ground to the deva Rucira­brahmā and the other inhabitants of the Brahmakāyika paradise who were seated upon some of the assembly seats.

source: །འཁོར་གྱི་སྟན་ལ་ལ་ནི་ལྷའི་རྒྱལ་པོ་དབང་སྒྱུར་ལ་སྩོགས་པ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་བུ་དང་ལྷའི་བུ་མོའི་འཁོར་དང་བཅས་པ་དག་འཁོད་ཅིང་། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས། ཆོས་ཀྱི་སྒོ་བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་རྣམ་པར་དག་པའི་དབང་གིས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called the display of the power of the pure motivation of bodhisattvas to the deva king Vaśavartin and other inhabitants of the Para­nirmita­vaśa­vartin paradise who were seated upon some of the assembly seats.

source: །འཁོར་གྱི་སྟན་ལ་ལ་ལ་ནི་ལྷའི་རྒྱལ་པོ་རབ་འཕྲུལ་དགའ་ལ་སྩོགས་པ་འཕྲུལ་དགའི་ལྷའི་བུ་ལྷའི་བུ་མོའི་འཁོར་དང་བཅས་པ་རྣམས་འཁོད་ཅིང་། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས། ཆོས་ཀྱི་སྒོ་ཐམས་ཅད་དགེ་བས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called the display of the goodness of all dharmas to the deva king Sunirmita and other devas and devīs of the Nirmāṇarati paradise who were seated upon some of the assembly seats.

source: །འཁོར་གྱི་སྟན་ལ་ལ་ལ་ནི་ལྷའི་རྒྱལ་པོ་རབ་དགའ་ལྡན་ལ་སྩོགས་པ། དགའ་ལྡན་གྱི་རིས་སུ་གཏོགས་པའི་ལྷའི་བུ་ལྷའི་བུ་མོའི་འཁོར་དང་བཅས་པ་རྣམས་འཁོད་ཅིང་། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས་ཆོས་ཀྱི་སྒོ་རང་གི་སེམས་ཀྱི་མཛོད་ཀྱི་གློང་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called the process of the treasure of one’s own mind to the deva king Saṃtuṣita and the other devas and devīs of the Tuṣita paradise who were seated upon some of the assembly seats.

source: །འཁོར་གྱི་སྟན་ལ་ལ་ལ་ནི་ལྷའི་རྒྱལ་པོ་རབ་མཚེ་མ་ལ་སྩོགས་པ་ལྷའི་བུ་ལྷའི་བུ་མོའི་འཁོར་དང་བཅས་པ་རྣམས་འཁོད་ཅིང་། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས། ཆོས་ཀྱི་སྒོ་རྒྱན་མཐའ་ཡས་པ་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called the infinite display to the deva king Suyāma and the other devas and devīs of the Yāma paradise who were seated upon some of the assembly seats.

source: །འཁོར་གྱི་སྟན་ལ་ལ་ལ་ནི་ལྷའི་རྒྱལ་པོ་བརྒྱ་བྱིན་ལ་སྩོགས་པ་སུམ་ཅུ་རྩ་གསུམ་གྱི་རིས་སུ་གཏོགས་པའི་ལྷའི་བུ་ལྷའི་བུ་མོའི་འཁོར་དང་བཅས་པ་རྣམ་འཁོད་ཅིང་། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས། ཆོས་ཀྱི་སྒོ་སྐྱོ་བའི་སྒོ་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called the gateway to revulsion to the deva king Śakra and the other devas and devīs of the Trāyastriṃśa paradise who were seated upon some of the assembly seats.

source: །འཁོར་གྱི་སྟན་ལ་ལ་ལ་ནི་ཀླུའི་རྒྱལ་པོ་གང་ཆེན་མཚོ་ལ་སྩོགས་པ་ཀླུའི་རྒྱལ་པོ་འོད་བརྒྱ་པ་དང་། དགའ་བོ་དང་བསྙེན་དགའ་བོ་དང་། ཡིད་དུ་འོང་བ་དང་། ཤུགས་ལྡན་དང་། མ་དྲོས་པ་ལ་སྩོགས་པ་ཀླུའི་བུ་མོའི་འཁོར་དང་བཅས་པ་ཀླུའི་བྱིས་པའི་འཁོར་དང་བཅས་པ་རྣམས་འཁོད་ཅིང་། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས། ཆོས་ཀྱི་སྒོ་སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་དང་། ཡུལ་གྱི་འོད་ཀྱི་བརྒྱན་ཅེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called the display of the light of miraclesand the range of activity of the buddhas to the nāga king Sāgara and other nāga kings—Śataraśmin, Nanda and Upananda, Manasya, Airāvata, Anavatapta, and so on—with their nāga sons and nāga daughters who were seated upon some of the assembly seats.

source: །འཁོར་གྱི་སྟན་ལ་ལ་ལ་ནི་རྒྱལ་པོ་ཆེན་པོ་ངལ་བསོ་པོ་ལ་སྩོགས་པ་གནོད་སྦྱིན་གྱི་དབང་པོ་གནོད་སྦྱིན་གྱི་བུ་མོ་དང་། གནོད་སྦྱིན་གྱི་བྱིས་པའི་འཁོར་དང་བཅས་པ་རྣམས་འཁོད་ཅིང་། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས། ཆོས་ཀྱི་སྒོ་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པའི་མཛོད་ཅེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called the treasure that protects all beings to Mahārāja Vaiśravaṇa and other lords of yakṣas, yakṣa daughters, and yakṣa sons who were seated upon some of the assembly seats.

source: །འཁོར་གྱི་སྟན་ལ་ལ་ལ་ནི་དྲི་ཟའི་རྒྱལ་པོ་གནས་སྲུང་པོ་ལ་སྩོགས་པ་དྲི་ཟ་མང་པོ་དྲི་ཟའི་བུ་མོ་དང་། དྲི་ཟའི་བྱིས་པའི་འཁོར་དང་བཅས་པ་རྣམས་འཁོད་ཅིང་། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས། ཆོས་ཀྱི་སྒོ་དགའ་བ་མི་ཟད་པ་ཆར་རབ་ཏུ་འབེབ་པ་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་། །འཁོར་གྱི་སྟན་ལ་ལ་ལ་ནི་ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་ལ་སྩོགས་པ་ལྷ་མ་ཡིན་རྣམས་ལྷ་མ་ཡིན་གྱི་བུ་མོ་དང་། ལྷ་མ་ཡིན་གྱི་བྱིས་པའི་འཁོར་དང་བཅས་པ་རྣམས་འཁོད་ཅིང་། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called rainfallof unceasing happiness to the gandharva king Dhṛtarāṣṭra and many other gandharvas, gandharva daughters, and gandharva sons who were seated upon some of the assembly seats.

source: ཆོས་ཀྱི་སྒོ་ཆོས་ཀྱི་དབྱིངས་ཤེས་པའི་ཚུལ་གྱི་ཤུགས་ཀྱིས་བརྒྱན་པ་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་། །འཁོར་གྱི་སྟན་ལ་ལ་ལ་ནི་ནམ་མཁའ་ལྡིང་གི་དབང་པོ་ཤུགས་འཛིན་ཆེན་པོ་ལ་སྩོགས་པ་ནམ་མཁའ་ལྡིང་གི་དབང་པོ་ནམ་མཁའ་ལྡིང་གི་བུ་མོ་དང་། ནམ་མཁའ་ལྡིང་གི་བྱིས་པའི་འཁོར་དང་བཅས་པ་རྣམས་འཁོད་ཅིང་།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called the display of the power of knowing the nature of phenomena to the asura lord Rāhu and other asura lords, asura daughters, and asura sons who were seated upon some of the assembly seats.

source: དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས། ཆོས་ཀྱི་སྒོ་སྲིད་པའི་རྒྱ་མཚོས་འཇིགས་པའི་ཡུལ་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་། །འཁོར་གྱི་སྟན་ལ་ལ་ལ་ནི་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་ལ་སྩོགས་པ། མི་འམ་ཅིའི་དབང་པོ་མིའམ་ཅིའི་བུ་མོ་དང་། མིའམ་ཅིའི་བྱིས་པའི་འཁོར་དང་བཅས་པ་རྣམས་འཁོད་ཅིང་། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called the range of the fear of the ocean of existence to the garuḍa lord Mahāvegadhārin and other garuḍa lords, garuḍa daughters, and garuḍa sons who were seated upon some of the assembly seats.

source: ཆོས་ཀྱི་སྒོ་སངས་རྒྱས་ཀྱི་སྤྱོད་པ་སྣང་བ་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་། །འཁོར་གྱི་སྟན་ལ་ལ་ལ་ནི་ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་ཁྲོ་གཉེར་གདོང་ལ་སྩོགས་པ། ལྟོ་འཕྱེ་ཆེན་པོའི་བུ་མོ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་བྱིས་པའི་འཁོར་དང་བཅས་པ་རྣམས་འཁོད་ཅིང་།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called the light of the conduct of buddhas to the kinnara lord Druma and other kinnara lords, kinnara daughters, and kinnara sons who were seated upon some of the assembly seats. He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called reaching a special wisdom to the mahoraga lord Bhṛkuṭīmukha and mahoraga daughters and mahoraga sons who were seated upon some of the assembly seats.

source: དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས། ཆོས་ཀྱི་སྒོ་སངས་རྒྱས་ལ་དགའ་བ་སྐྱེ་བ་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་། །འཁོར་གྱི་སྟན་ལ་ལ་ལ་ནི་སྐྱེས་པ་དང་། བུད་མྱེད་དང་། ཁྱེའུ་དང་བུ་མོ་བརྒྱ་སྟོང་མང་པོ་འཁོད་ཅིང་། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called the arising of delight toward the buddhas to many hundreds of thousands of men, women, boys, and girls who were seated upon some of the assembly seats.

source: ཆོས་ཀྱི་སྒོ་ཁྱད་པར་དུ་འགྲོ་བ་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་པ་མཐོང་ངོ་། །འཁོར་གྱི་སྟན་ལ་ལ་ལ་ནི་སྲིན་པོའི་དབང་པོ་རྟག་ཏུ་མདངས་འཕྲོག་པ་སྡོང་པོའི་རྒྱལ་པོ་ལ་སྩོགས་པ་སྲིན་པོའི་དབང་པོ་སྲིན་པོའི་བུ་མོ་དང་སྲིན་པོའི་བྱིས་པའི་འཁོར་དང་བཅས་པ་རྣམས་འཁོད་ཅིང་།
en: He saw the bhikṣuṇī Siṃha­vijṛmbhitā teaching the Dharma gateway called the arising of compassion to the rākṣasa lord Nityaujohara­druma­rāja and to other rākṣasa lords, rākṣasa daughters, and rākṣasa sons who were seated upon some of the assembly seats.
